# 2 Life Saving Pandas Tricks

In [36]:
import pandas as pd 
candidates_df = pd.read_csv("candidates.csv")
candidates_df

      Name    Degree     From  Years_exp  From_office(min) Application_date
0     Aida    Master  Abidjan          2               120       11/17/2022
1  Mamadou    Master    Dakar          3                95       09/23/2022
2   Ismael  Bachelor   Bamako          0                75        12/2/2021
3    Aicha       PhD  Abidjan          5                80       08/25/2022
4    Fatou    Master  Konakry          4               100       01/07/2022
5   Khalil       PhD     Lomé          3                34       12/26/2022

In [37]:
candidates_df.dtypes

Name                object
Degree              object
From                object
Years_exp            int64
From_office(min)     int64
Application_date    object
dtype: object

## Format Date Column

In [38]:
candidates_df = pd.read_csv("candidates.csv", parse_dates = ["Application_date"])
candidates_df.dtypes

Name                        object
Degree                      object
From                        object
Years_exp                    int64
From_office(min)             int64
Application_date    datetime64[ns]
dtype: object

## SQL - Like Query

In [39]:
# Get all the candidates with a Master degree
ms_candidates = candidates_df.query("Degree == 'Master'")
ms_candidates

      Name  Degree     From  Years_exp  From_office(min) Application_date
0     Aida  Master  Abidjan          2               120       2022-11-17
1  Mamadou  Master    Dakar          3                95       2022-09-23
4    Fatou  Master  Konakry          4               100       2022-01-07

In [40]:
# Get values from list
list_locations = ["Abidjan", "Dakar"]
candiates = candidates_df.query("From in @list_locations")
candiates

      Name  Degree     From  Years_exp  From_office(min) Application_date
0     Aida  Master  Abidjan          2               120       2022-11-17
1  Mamadou  Master    Dakar          3                95       2022-09-23
3    Aicha     PhD  Abidjan          5                80       2022-08-25